import streamlit as st


st.write(
"""
# 🎵《韵律源点》知识图谱与问答系统

*梁梓俊 禤昊炜 刘思哲 翁宇锋*

## 🎉项目简介

本项目旨在为《韵律源点》的玩家提供一个数据查询的平台，通过知识图谱技术，基于游戏内容的数据，构建一个包含实体、关系、属性的知识图谱，并通过基于大语言模型的问答系统，使用户能够更自然、更方便地查询与游戏内容相关的数据，为玩家提供更好的游戏体验。

## 📚项目内容

- **数据获取**：通过爬虫技术，获取《韵律源点》的游戏内容数据。
- **数据预处理**：对爬取到的数据进行清洗、处理，构建知识图谱所需的数据。
- **知识图谱**：基于《韵律源点》的游戏内容，构建一个包含实体、关系、属性的知识图谱。
- **问答系统**：基于大语言模型的问答系统，使用户能够通过自然语言查询与游戏内容相关的数据。

## 🚀项目成员

- **梁梓俊**：负责整体框架设计、知识图谱构建、问答系统开发。
- **禤昊炜**：负责数据爬取、数据预处理
- **刘思哲**：负责数据预处理
- **翁宇锋**：负责数据统筹、项目管理
""" 
)